zephyrproject-rtos/zephyr/boards/arm/mimxrt685_evk/pinmux.c
	uint32_t port2_pin1_config = (/* Pin is configured as SD0_D1 */
		IOPCTL_PIO_FUNC1 |
		/* Enable pull-up / pull-down function */
		IOPCTL_PIO_PUPD_EN |
		/* Enable pull-up function */
		IOPCTL_PIO_PULLUP_EN |
		/* Enables input buffer function */
		IOPCTL_PIO_INBUF_EN |
		/* Normal mode */
		IOPCTL_PIO_SLEW_RATE_NORMAL |
		/* Normal drive */
		IOPCTL_PIO_FULLDRIVE_DI |
		/* Analog mux is disabled */
		IOPCTL_PIO_ANAMUX_DI |
		/* Pseudo Output Drain is disabled */
		IOPCTL_PIO_PSEDRAIN_DI |
		/* Input function is not inverted */
		IOPCTL_PIO_INV_DI);
	/* PORT2 PIN1 (coords: T11) is configured as SD0_D1 */
	IOPCTL_PinMuxSet(IOPCTL, 2U, 1U, port2_pin1_config);

	uint32_t port2_pin10_config = (/* Pin is configured as PIO2_10 */
		IOPCTL_PIO_FUNC0 |
		/* Disable pull-up / pull-down function */
		IOPCTL_PIO_PUPD_DI |
		/* Enable pull-down function */
		IOPCTL_PIO_PULLDOWN_EN |
		/* Disable input buffer function */
		IOPCTL_PIO_INBUF_DI |
		/* Normal mode */
		IOPCTL_PIO_SLEW_RATE_NORMAL |
		/* Normal drive */
		IOPCTL_PIO_FULLDRIVE_DI |
		/* Analog mux is disabled */
		IOPCTL_PIO_ANAMUX_DI |
		/* Pseudo Output Drain is disabled */
		IOPCTL_PIO_PSEDRAIN_DI |
		/* Input function is not inverted */
		IOPCTL_PIO_INV_DI);
	/* PORT2 PIN10 (coords: T15) is configured as PIO2_10 */
	IOPCTL_PinMuxSet(IOPCTL, 2U, 10U, port2_pin10_config);

	uint32_t port2_pin2_config = (/* Pin is configured as SD0_D2 */
		IOPCTL_PIO_FUNC1 |
		/* Enable pull-up / pull-down function */
		IOPCTL_PIO_PUPD_EN |
		/* Enable pull-up function */
		IOPCTL_PIO_PULLUP_EN |
		/* Enables input buffer function */
		IOPCTL_PIO_INBUF_EN |
		/* Normal mode */
		IOPCTL_PIO_SLEW_RATE_NORMAL |
		/* Normal drive */
		IOPCTL_PIO_FULLDRIVE_DI |
		/* Analog mux is disabled */
		IOPCTL_PIO_ANAMUX_DI |
		/* Pseudo Output Drain is disabled */
		IOPCTL_PIO_PSEDRAIN_DI |
		/* Input function is not inverted */
		IOPCTL_PIO_INV_DI);
	/* PORT2 PIN2 (coords: U11) is configured as SD0_D2 */
	IOPCTL_PinMuxSet(IOPCTL, 2U, 2U, port2_pin2_config);

	uint32_t port2_pin3_config = (/* Pin is configured as SD0_D3 */
		IOPCTL_PIO_FUNC1 |
		/* Enable pull-up / pull-down function */
		IOPCTL_PIO_PUPD_EN |
		/* Enable pull-up function */
		IOPCTL_PIO_PULLUP_EN |
		/* Enables input buffer function */
		IOPCTL_PIO_INBUF_EN |
		/* Normal mode */
		IOPCTL_PIO_SLEW_RATE_NORMAL |
		/* Normal drive */
		IOPCTL_PIO_FULLDRIVE_DI |
		/* Analog mux is disabled */
		IOPCTL_PIO_ANAMUX_DI |
		/* Pseudo Output Drain is disabled */
		IOPCTL_PIO_PSEDRAIN_DI |
		/* Input function is not inverted */
		IOPCTL_PIO_INV_DI);
	/* PORT2 PIN3 (coords: T12) is configured as SD0_D3 */
	IOPCTL_PinMuxSet(IOPCTL, 2U, 3U, port2_pin3_config);

	uint32_t port2_pin4_config = (/* Pin is configured as PIO2_4 */
		IOPCTL_PIO_FUNC0 |
		/* Disable pull-up / pull-down function */
		IOPCTL_PIO_PUPD_DI |
		/* Enable pull-down function */
		IOPCTL_PIO_PULLDOWN_EN |
		/* Disable input buffer function */
		IOPCTL_PIO_INBUF_DI |
		/* Normal mode */
		IOPCTL_PIO_SLEW_RATE_NORMAL |
		/* Normal drive */
		IOPCTL_PIO_FULLDRIVE_DI |
		/* Analog mux is disabled */
		IOPCTL_PIO_ANAMUX_DI |
		/* Pseudo Output Drain is disabled */
		IOPCTL_PIO_PSEDRAIN_DI |
		/* Input function is not inverted */
		IOPCTL_PIO_INV_DI);
	/* PORT2 PIN4 (coords: T13) is configured as PIO2_4 */
	IOPCTL_PinMuxSet(IOPCTL, 2U, 4U, port2_pin4_config);

	uint32_t port2_pin9_config = (/* Pin is configured as SD0_CARD_DET_N */
		IOPCTL_PIO_FUNC1 |
		/* Enable pull-up / pull-down function */
		IOPCTL_PIO_PUPD_EN |
		/* Enable pull-up function */
		IOPCTL_PIO_PULLUP_EN |
		/* Enables input buffer function */
		IOPCTL_PIO_INBUF_EN |
		/* Normal mode */
		IOPCTL_PIO_SLEW_RATE_NORMAL |
		/* Normal drive */
		IOPCTL_PIO_FULLDRIVE_DI |
		/* Analog mux is disabled */
		IOPCTL_PIO_ANAMUX_DI |
		/* Pseudo Output Drain is disabled */
		IOPCTL_PIO_PSEDRAIN_DI |
		/* Input function is not inverted */
		IOPCTL_PIO_INV_DI);
	/* PORT2 PIN9 (coords: R13) is configured as SD0_CARD_DET_N */
	IOPCTL_PinMuxSet(IOPCTL, 2U, 9U, port2_pin9_config);
#endif

	return 0;
}

/* priority set to CONFIG_PINMUX_INIT_PRIORITY value */
SYS_INIT(mimxrt685_evk_pinmux_init, PRE_KERNEL_1, 45);
